import { CalendarHoliday } from "../props.interface";

export const RUSSIAN_HOLIDAYS: CalendarHoliday[] = [
  {
    date: "YYYY-0-1", // Дата
    name: "Новый год", // Название
    description: "Новогодние каникулы", // Описание
    icon: "🎄", // Иконка
    color: "#ef5350", // Цвет события
    durationDays: 7, // Длительность в днях
  },
  {
    date: "YYYY-0-7", // Дата
    name: "Рождество Христово", // Название
    description: "Рождество Христово", // Описание
    icon: "🎅", // Иконка
    color: "#8008ff", // Цвет события
    durationDays: 1, // Длительность в днях
  },
  {
    date: "YYYY-1-23", // Дата
    name: "День защитника Отечества", // Название
    description: "День защитника Отечества", // Описание
    icon: "🛡️", // Иконка
    color: "#8008ff", // Цвет события
    durationDays: 1, // Длительность в днях
  },
  {
    date: "YYYY-2-8", // Дата
    name: "Международный женский день", // Название
    description: "Международный женский день", // Описание
    icon: "💐", // Иконка
    color: "#8008ff", // Цвет события
    durationDays: 1, // Длительность в днях
  },
  {
    date: "YYYY-4-1", // Дата
    name: "Праздник Весны и Труда", // Название
    description: "Праздник Весны и Труда", // Описание
    icon: "🛠️", // Иконка
    color: "#8008ff", // Цвет события
    durationDays: 1, // Длительность в днях
  },
  {
    date: "YYYY-4-9", // Дата
    name: "День Победы", // Название
    description: "День Победы", // Описание
    icon: "🎗️", // Иконка
    color: "#8008ff", // Цвет события
    durationDays: 1, // Длительность в днях
  },
  {
    date: "YYYY-5-12", // Дата
    name: "День России", // Название
    description: "День России", // Описание
    icon: "🇷🇺", // Иконка
    color: "#8008ff", // Цвет события
    durationDays: 1, // Длительность в днях
  },
  {
    date: "YYYY-10-4", // Дата
    name: "День народного единства", // Название
    description: "День народного единства", // Описание
    icon: "😇", // Иконка
    color: "#8008ff", // Цвет события
    durationDays: 1, // Длительность в днях
  },
];